<h1>Aggregating Data<h1>

In [1]:
import pandas as pd
bios=pd.read_csv("data/bios.csv")

In [2]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [3]:
bios['born_city'].value_counts()

born_city
Budapest            1378
Moskva (Moscow)      883
Oslo                 708
Stockholm            629
Praha (Prague)       600
                    ...
Tsivilsk               1
Roth                   1
Romoos                 1
Dva Polya Artash       1
Dulwich Hill           1
Name: count, Length: 22368, dtype: int64

In [5]:
bios[bios['born_country']=="IND"]['born_region'].value_counts()

born_region
Punjab                                 94
Maharashtra                            56
West Bengal                            49
Haryana                                43
Uttar Pradesh                          42
Tamil Nadu                             34
Karnataka                              32
National Capital Territory of Delhi    32
Kerala                                 26
Andhra Pradesh                         23
Madhya Pradesh                         22
Rajasthan                              14
Himachal Pradesh                       10
Manipur                                10
Gujarat                                 9
Bihar                                   6
Jharkhand                               5
Assam                                   5
Jammu and Kashmir                       5
Uttarakhand                             4
Tripura                                 3
Chhattisgarh                            2
Chandigarh                              2
Goa                                     2
Nagaland                                2
Mizoram                                 1
Puducherry                              1
Sikkim                                  1
Orissa                                  1
Name: count, dtype: int64

In [6]:
coffee=pd.read_csv("data/coffee.csv")

In [7]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [9]:
coffee.groupby(['Coffee Type'])["Units Sold"].sum()

Coffee Type
Espresso    265
Latte       195
Name: Units Sold, dtype: int64

In [10]:
coffee.groupby(['Coffee Type'])["Units Sold"].mean()

Coffee Type
Espresso    37.857143
Latte       27.857143
Name: Units Sold, dtype: float64

In [11]:
coffee.groupby(['Coffee Type'])["Units Sold"].max()

Coffee Type
Espresso    45
Latte       35
Name: Units Sold, dtype: int64

In [12]:
coffee.groupby(['Coffee Type'])["Units Sold"].min()

Coffee Type
Espresso    25
Latte       15
Name: Units Sold, dtype: int64

In [15]:
coffee.groupby(['Coffee Type']).agg({'Units Sold':'sum'})

             Units Sold
Coffee Type
Espresso            265
Latte               195

In [18]:
import numpy as np
coffee["price"]=np.where(coffee["Coffee Type"]=="Espresso", 150,200)

In [21]:
coffee.head()

         Day Coffee Type  Units Sold  price
0     Monday    Espresso          25    150
1     Monday       Latte          15    200
2    Tuesday    Espresso          30    150
3    Tuesday       Latte          20    200
4  Wednesday    Espresso          35    150

In [23]:
coffee['revenue']=coffee['Units Sold']*coffee['price']

In [24]:
coffee.head()

         Day Coffee Type  Units Sold  price  revenue
0     Monday    Espresso          25    150     3750
1     Monday       Latte          15    200     3000
2    Tuesday    Espresso          30    150     4500
3    Tuesday       Latte          20    200     4000
4  Wednesday    Espresso          35    150     5250

In [25]:
pi=coffee.pivot(columns='Coffee Type',index='Day',values='revenue')
pi

Coffee Type  Espresso  Latte
Day
Friday           6750   7000
Monday           3750   3000
Saturday         6750   7000
Sunday           6750   7000
Thursday         6000   6000
Tuesday          4500   4000
Wednesday        5250   5000

In [ ]:
pi.loc['Monday','Latte'] #easy access

np.int64(3000)

In [27]:
pi.sum()

Coffee Type
Espresso    39750
Latte       39000
dtype: int64

In [28]:
pi.sum(axis=1)

Day
Friday       13750
Monday        6750
Saturday     13750
Sunday       13750
Thursday     12000
Tuesday       8500
Wednesday    10250
dtype: int64

In [29]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [32]:
bios['born_date']=pd.to_datetime(bios['born_date'])
bios.groupby([bios['born_date'].dt.year]).count()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
born_date,,,,,,,,,,
1828.0,1,1,1,1,1,1,1,0,0,1
1831.0,2,2,2,2,2,2,2,0,0,2
1833.0,1,1,1,1,1,1,1,0,0,1
1836.0,1,1,1,1,1,1,1,0,0,1
1837.0,1,1,1,1,1,1,1,0,0,1
...,...,...,...,...,...,...,...,...,...,...
2005.0,163,163,163,64,64,64,163,13,12,1
2006.0,17,17,17,8,8,8,17,1,0,0
2007.0,3,3,3,1,1,1,3,0,0,0
2008.0,3,3,3,2,2,2,3,1,1,0
2009.0,1,1,1,1,1,1,1,0,0,0

In [33]:
bios.groupby([bios['born_date'].dt.year])['name'].count()

born_date
1828.0      1
1831.0      2
1833.0      1
1836.0      1
1837.0      1
         ...
2005.0    163
2006.0     17
2007.0      3
2008.0      3
2009.0      1
Name: name, Length: 177, dtype: int64

In [34]:
bios.groupby([bios['born_date'].dt.year])['name'].count().reset_index()

     born_date  name
0       1828.0     1
1       1831.0     2
2       1833.0     1
3       1836.0     1
4       1837.0     1
..         ...   ...
172     2005.0   163
173     2006.0    17
174     2007.0     3
175     2008.0     3
176     2009.0     1

[177 rows x 2 columns]

In [35]:
bios.groupby([bios['born_date'].dt.year])['name'].count().reset_index().sort_values('name')

     born_date  name
0       1828.0     1
2       1833.0     1
3       1836.0     1
4       1837.0     1
6       1839.0     1
..         ...   ...
137     1970.0  2174
138     1971.0  2205
140     1973.0  2216
152     1985.0  2227
139     1972.0  2231

[177 rows x 2 columns]

<h1>Advanced Functionality<h1>

In [38]:
coffee['yesterday_revenue']=coffee['revenue'].shift(2)

In [39]:
coffee

          Day Coffee Type  Units Sold  price  revenue  yesterday_revenue
0      Monday    Espresso          25    150     3750                NaN
1      Monday       Latte          15    200     3000                NaN
2     Tuesday    Espresso          30    150     4500             3750.0
3     Tuesday       Latte          20    200     4000             3000.0
4   Wednesday    Espresso          35    150     5250             4500.0
5   Wednesday       Latte          25    200     5000             4000.0
6    Thursday    Espresso          40    150     6000             5250.0
7    Thursday       Latte          30    200     6000             5000.0
8      Friday    Espresso          45    150     6750             6000.0
9      Friday       Latte          35    200     7000             6000.0
10   Saturday    Espresso          45    150     6750             6750.0
11   Saturday       Latte          35    200     7000             7000.0
12     Sunday    Espresso          45    150     6750             6750.0
13     Sunday       Latte          35    200     7000             7000.0

In [45]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [54]:
bios['height_rank']=bios['height_cm'].rank(ascending=False)
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_rank
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,NaN
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,27597.5
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,27597.5
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,83975.0
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,NaN

In [59]:
bios.sort_values('height_rank')

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_rank
89070,89782,Yao Ming,1980-09-12,Xuhui District,Shanghai,CHN,People's Republic of China,226.0,141.0,NaN,1.0
6978,7013,Arvydas Sabonis,1964-12-19,Kaunas,Kaunas,LTU,Lithuania Soviet Union,223.0,122.0,NaN,2.5
5781,5804,Tommy Burleson,1952-02-24,Crossnore,North Carolina,USA,United States,223.0,102.0,NaN,2.5
5673,5696,Gunther Behnke,1963-01-19,Leverkusen,Nordrhein-Westfalen,GER,Germany,221.0,114.0,NaN,5.0
89075,89787,Roberto Dueñas,1975-11-01,Madrid,Madrid,ESP,Spain,221.0,137.0,NaN,5.0
...,...,...,...,...,...,...,...,...,...,...,...
145490,149217,Sin Ye-Chan,1995-06-13,NaN,NaN,NaN,Republic of Korea,NaN,NaN,NaN,NaN
145491,149218,Matthew Wepke,1989-12-05,NaN,NaN,NaN,Jamaica,NaN,NaN,NaN,NaN
145492,149219,Carlos García-Ordóñez,1927-04-24,La Habana (Havana),Ciudad de La Habana,CUB,Cuba,NaN,NaN,2019-11-24,NaN
145493,149220,Landysh Falyakhova,1998-08-31,Dva Polya Artash,Respublika Tatarstan,RUS,ROC,NaN,NaN,NaN,NaN
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,NaN

In [60]:
bios.sort_values('height_rank')[['name',"height_rank"]]

                         name  height_rank
89070                Yao Ming          1.0
6978          Arvydas Sabonis          2.5
5781           Tommy Burleson          2.5
5673           Gunther Behnke          5.0
89075          Roberto Dueñas          5.0
...                       ...          ...
145490            Sin Ye-Chan          NaN
145491          Matthew Wepke          NaN
145492  Carlos García-Ordóñez          NaN
145493     Landysh Falyakhova          NaN
145499          Bill Phillips          NaN

[145500 rows x 2 columns]

In [61]:
coffee.info()

<class 'pandas.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Day                14 non-null     str
 1   Coffee Type        14 non-null     str
 2   Units Sold         14 non-null     int64
 3   price              14 non-null     int64
 4   revenue            14 non-null     int64
 5   yesterday_revenue  12 non-null     float64
dtypes: float64(1), int64(3), str(2)
memory usage: 995.0 bytes

In [62]:
coffee['cumulative_revenue']=coffee['revenue'].cumsum()

In [64]:
coffee

,Day,Coffee Type,Units Sold,price,revenue,yesterday_revenue,cumulative_revenue
0,Monday,Espresso,25,150,3750,NaN,3750
1,Monday,Latte,15,200,3000,NaN,6750
2,Tuesday,Espresso,30,150,4500,3750.0,11250
3,Tuesday,Latte,20,200,4000,3000.0,15250
4,Wednesday,Espresso,35,150,5250,4500.0,20500
5,Wednesday,Latte,25,200,5000,4000.0,25500
6,Thursday,Espresso,40,150,6000,5250.0,31500
7,Thursday,Latte,30,200,6000,5000.0,37500
8,Friday,Espresso,45,150,6750,6000.0,44250
9,Friday,Latte,35,200,7000,6000.0,51250
10,Saturday,Espresso,45,150,6750,6750.0,58000
11,Saturday,Latte,35,200,7000,7000.0,65000
12,Sunday,Espresso,45,150,6750,6750.0,71750
13,Sunday,Latte,35,200,7000,7000.0,78750

In [65]:
pd.__version__

'3.0.0'

In [ ]:
result_numpy=pd.read_csv('./data/results.csv') #It still uses the C Engine by default
result_arrow=pd.read_csv('./data/results.csv', engine='pyarrow',dtype_backend='pyarrow') # Pyarrow provide more optimization and efficience then numpy

In [78]:
result_numpy.info()

<class 'pandas.DataFrame'>
RangeIndex: 308408 entries, 0 to 308407
Data columns (total 11 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   year        305807 non-null  float64
 1   type        305807 non-null  str
 2   discipline  308407 non-null  str
 3   event       308408 non-null  str
 4   as          308408 non-null  str
 5   athlete_id  308408 non-null  int64
 6   noc         308407 non-null  str
 7   team        121714 non-null  str
 8   place       283193 non-null  float64
 9   tied        308408 non-null  bool
 10  medal       44139 non-null   str
dtypes: bool(1), float64(2), int64(1), str(7)
memory usage: 46.0 MB

In [79]:
result_arrow.info()

<class 'pandas.DataFrame'>
RangeIndex: 308408 entries, 0 to 308407
Data columns (total 11 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   year        305807 non-null  double[pyarrow]
 1   type        305807 non-null  string[pyarrow]
 2   discipline  308407 non-null  string[pyarrow]
 3   event       308408 non-null  string[pyarrow]
 4   as          308408 non-null  string[pyarrow]
 5   athlete_id  308408 non-null  int64[pyarrow]
 6   noc         308407 non-null  string[pyarrow]
 7   team        121714 non-null  string[pyarrow]
 8   place       283193 non-null  double[pyarrow]
 9   tied        308408 non-null  bool[pyarrow]
 10  medal       44139 non-null   string[pyarrow]
dtypes: bool[pyarrow](1), double[pyarrow](2), int64[pyarrow](1), string[pyarrow](7)
memory usage: 37.5 MB